const axios = require("axios");

const apiList = "https://raw.githubusercontent.com/shahadat-sahu/SAHU-API/refs/heads/main/SAHU-API.json";

const getMainAPI = async () => (await axios.get(apiList)).data.simsimi;

module.exports.config = {
  name: "autoreplybot",
  version: "2.0.0",
  hasPermssion: 0,
  credits: "SHAHADAT SAHU",
  usePrefix: false,
  commandCategory: "Chat",
  cooldowns: 0
};

module.exports.handleEvent = async function ({ api, event }) {
  const { threadID, messageID, body, senderID } = event;
  if (!body) return;

  const msg = body.toLowerCase().trim();

  const responses = {
    "miss you": "অরেক বেডারে Miss না করে xan মেয়ে হলে বস ইয়াকুব রে হাঙ্গা করো😶👻😘",
    "miss u too": "হুম আমি ও তোমাকে Miss করি... কিন্তু ইয়াকুব বস বেশি করে 😏💖",
    "kiss de": "কিস দিও না তোমার মুখে দূর গন্ধ কয়দিন ধরে দাঁত ব্রাশ করো নাইʚ🥲ɞ ʚ🥲ɞ ",
    "👍": "ধুর কেউ কথা বলে না খালি লাইক দেয়..!🐸🤣👍⛏️",
    "hi": "এত হাই-হ্যালো না করে সালাম দিতে শিখো প্রিও..!😜🫵",
    "bc": "SAME TO YOU😊",
    "pro": "Khud k0o KYa LeGend SmJhTi Hai 😂",
    "good morning": "GOOD MORNING তোমার দিনটা ভালো কাটুক দাত ব্রাশ করে খেয়ে নেও😚",
    "good night": "Sweet Dream babu… রাতে তোমাকে মিস করবো  💤",
    "tor ball": "~ পচা কথা বলিও না ?? 🤖",
    "@Yakub Hossen": "উনি এখন কাজে বিজি আছে কি বলবেন আমাকে বলতে পারেন..!😘",
    "owner": "‎[𝐎𝐖𝐍𝐄𝐑:☞ Yakub Hossen ☜\nFacebook:  https://www.facebook.com/share/1GDR8mCk2t/\nWhatsApp: +88018609833375",
    "admin": "ও গ্রুপের এডমিন শুনছো এই ভদ্র লোক আপনাকে খুজতেছে 😘☺️",
    "babi": "এ তো হাছিনা হে মেরে দিলকি দারকান হে মেরি জান হে😍.",
    "chup": "আমি চুপ করলে তোমাদের সাথে কে কথা বলবে ʚ😭ɞ ʚ😭ɞ ʚ😭ɞ ",
    "Assalamualaikum": "Walaikumassalam❤️‍🩹 আপনার মতো মেম্বার পেয়ে আমরা গর্ব বোধ করি",
    "fork": "https://www.facebook.com/share/1GDR8mCk2t/ ভাইয়ের কাছে আছে ইনবক্স করে নিয়ে নেও",
    "kiss me": "তুমি পঁচা তোমাকে কিস দিবো না 🤭",
    "thanks": "আপনাকেও ধন্যবাদ আপনাকে সাহায্য করতে পারলে আমাদের ও ভালো লাগে..!🐸",
    "i love you": "আমার মনে হয় প্রেম না করে সরাসরি বিয়ে করা উচিৎ🫢😻",
    "love you": "হায়রে ভালোবাসা,মানুষের দূর্বলতা এখানেই ʚ😌ɞ  😘",
    "by": "যদি জরুরি কোনো কাজ থাকে তাহলে যাও..!🌚🌶️",
    "Ami Yakub": "আজকে আমি কোনো খারাপ কাজ করি নাই প্লিজ আমাকে বকা দিবেন না ʚ🥺ɞ ʚ🥺ɞ ..☺️",
    "bot er baccha": "তোমরা বকা দিলে আমি কার সাথে কথা বলবো ʚ🥲ɞ ʚ🥲ɞ ..!!🌚⛏️",
    "tor nam ki": "MY NAME IS ─꯭─⃝‌‌𝐒𝐈𝐍𝐇𝐀 𝐁𝐎𝐓💖",
    "pic de": "পরে দিবো যদি ইয়াকুব ভাই দিতে বলে 😒",
    "cdi": "সব যদি এখানেই করো তাহলে বাসর রাতে কি করবা..!🥱🌝🌚",
    "bal": "রাগ করে না সোনা পাখি 🥰",
    "heda": "এতো রাগ শরীরের জন্য ভালো না 🥰",
    "boda": "কার?..!🌚🤣",
    "kire ki koros": "তোমার কথা ভাবতে ছি জানু 😚",
    "ki koros": "𝐚𝐢𝐭𝐨 𝐭𝐨𝐦𝐚𝐫 𝐬𝐚𝐭𝐚 𝐤𝐨𝐭𝐚 𝐛𝐨𝐥𝐭𝐚𝐬𝐞 😏💘",
    "kire bot": "হ্যাঁ সব কেমন আছেন 😘😽🙈",
    "valo aso": "হ্যাঁ রে প্রিও, 😌💞",
    "pagol": "হুম পাগল, কিন্তু তোমারই পাগল 😏😂",
    "breakup": "তুমিও ছেড়ে চলে যাবে ʚ😭ɞ ",
    "tui ke": "আমি তোর বস ইয়াকুব এর ChatBot 😏",
    "umm": "এতো Umm কেনো জানু… কিছু বলবা? 😉",
    "hmm": "Hmmm কিসের হুমম জানু ",
    "love": "Love করলে সরাসরি বস কে বল জানু 😻🔥"
  };

  if (!responses[msg]) return;

  if (!global.client.handleReply) global.client.handleReply = [];

  return api.sendMessage(
    responses[msg],
    threadID,
    (err, info) => {
      global.client.handleReply.push({
        name: this.config.name,
        messageID: info.messageID,
        author: senderID,
        type: "sahu"
      });
    },
    messageID
  );
};

module.exports.handleReply = async function ({ api, event, handleReply }) {
  if (event.senderID !== handleReply.author) return;

  try {
    const text = event.body.trim();

    const base = await getMainAPI();
    const link = `${base}/simsimi?text=${encodeURIComponent(text)}`;

    const res = await axios.get(link);

    const reply = Array.isArray(res.data.response)
      ? res.data.response[0]
      : res.data.response;

    if (!global.client.handleReply) global.client.handleReply = [];

    return api.sendMessage(
      reply,
      event.threadID,
      (err, info) => {
        global.client.handleReply.push({
          name: module.exports.config.name,
          messageID: info.messageID,
          author: event.senderID,
          type: "sahu"
        });
      },
      event.messageID
    );

  } catch {
    return api.sendMessage("🙂 একটু পরে আবার বলো", event.threadID, event.messageID);
  }
};

module.exports.run = async function ({ api, event }) {
  return module.exports.handleEvent({ api, event });
};
