module.exports.config = {
 name: "adminmention",
 version: "1.0.0",
 hasPermssion: 0,
 credits: "SHAHADAT SAHU ",
 description: "Bot will reply when someone tags any of the admins",
 commandCategory: "Other",
 usages: "@",
 cooldowns: 1
};

module.exports.handleEvent = function({ api, event }) {
 const adminIDs = ["61574007381785", "61574007381785", "61574007381785"].map(String); //update your UID✅
 
 if (adminIDs.includes(String(event.senderID))) return;

 const mentionedIDs = event.mentions ? Object.keys(event.mentions).map(String) : [];
 const isMentioningBoss = adminIDs.some(adminID => mentionedIDs.includes(adminID));

 if (isMentioningBoss) {
 const replies = [
 "ডাকাডাকি করিস না বস ইয়াকুব ব্যস্ত আছে 😒😌",
 "ইয়াকুব বস একজন আপনাকে মেনশন দিছে 😑🌚😁",
 "যেভাবে মেনশন দিচ্ছেন মনে হয় আপনার গার্লফ্রেন্ডটারে , আমার বস ইয়াকুব কে দিয়া দিবেন 🫥😒",
 "ইয়াকুব বস এক লোক, আপনাকে ডাকতেছে 🐸🫵",
 "বস ইয়াকুব এক হালায় আপনার নাম ধরছে , আপনি শুধু একবার আদেশ করুন, আজকে হালার নানিরে চমলক্ক করে দিমু 😑🥴",
 "মেনশন না দিয়া বস ইয়াকুব কে একটা girlfriend খুজে দে 🙃😮💨",
 "মাইয়া হলে বস ইয়াকুব এর ইনবক্স এ যাও😗😁",
 "ইয়াকুব স্যার এখন ব্যস্ত আছে , কিছু বলতে হলে ইনবক্স এ গিয়া বল",
 "বস ইয়াকুব এখন আমার সাথে মিটিং এ আছে , মেনশন দিও না 🙂",
 "বস ইয়াকুব এখন ব্যস্ত আছে , কি বলবেন আমাকে বলেন",
 "মেনশন না দিয়া ইয়াকুব স্যারের ইনবক্সে যাই কথা বল ",
 "কিরে তোমার এতো সাহস আমার বসের নাম ধরো কেন😾🫵",
 "এতো মেনশন না দিয়া তোর গার্লফ্রেন্ডটারে দিয়া দে😹🐸",
 "মেনশন দিয়ে লাভ নাই বস 𝐘𝐚𝐤𝐮𝐛 এখন বিজি আছেন😗😘"
 ];
 return api.sendMessage(replies[Math.floor(Math.random() * replies.length)], event.threadID, event.messageID);
 }
};

module.exports.run = async function() {};
